Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroupAttributes Constructor
Overload List
Name | Description
ReinforcementBase.ReinforcementSetGroupAttributes()
 Initializes a new instance of the ReinforcementBase.ReinforcementSetGroupAttributes class.
ReinforcementBase.ReinforcementSetGroupAttributes(String)
 Initializes a new instance of the ReinforcementBase.ReinforcementSetGroupAttributes class that loads the specified attributes.
Top
See Also
Reference
ReinforcementBase.ReinforcementSetGroupAttributes Class
Tekla.Structures.Drawing Namespace